{"sections":{"f0623cb4-d61c-477b-9340-88388719a38f":{"type":"breadcrumb","disabled":true,"settings":{"text_alignment":"left","hide_current":false,"hide_on_mb":false,"padding_top":14,"padding_bottom":0,"animations":"inherit"}},"main":{"type":"page","custom_css":[],"settings":{"use_container_narrow":true,"show_breadcrumb":true,"show_page_content":false,"page_header_padding_top":30,"page_header_padding_bottom":30,"padding_top":0,"padding_bottom":30}},"custom_content_TMAANp":{"type":"custom-content","blocks":{"text_4wLaMX":{"type":"text","settings":{"width":"100%","alignment":"center","align_text":"left","title":"Payment Methods:","text_size":"h2","subheading":"","text":"<p>We accept the following methods of payment:<\/p>","text_color":"body","button_label":"","button_link":"","button_style":"m-button--primary","block_custom_class":"","animations":"inherit"}},"image_xaga4K":{"type":"image","settings":{"width":"16%","alignment":"center","image":"shopify:\/\/shop_images\/Old_Visa_Logo_svg.png","link":"","block_custom_class":"","animations":"inherit"}},"image_xBBXye":{"type":"image","settings":{"width":"16%","alignment":"center","image":"shopify:\/\/shop_images\/Mastercard_new_logo-1200x865.webp","link":"","block_custom_class":"","animations":"inherit"}},"image_4FL9B8":{"type":"image","settings":{"width":"16%","alignment":"center","image":"shopify:\/\/shop_images\/Maestro_Logo_svg.png","link":"","block_custom_class":"","animations":"inherit"}},"image_Mf8hkb":{"type":"image","settings":{"width":"16%","alignment":"center","image":"shopify:\/\/shop_images\/vinnytsia-ukraine-september-6-2023-600nw-2358048941.webp","link":"","block_custom_class":"","animations":"inherit"}},"image_GgEejK":{"type":"image","settings":{"width":"16%","alignment":"center","image":"shopify:\/\/shop_images\/klarna-big.png","link":"","block_custom_class":"","animations":"inherit"}},"image_NVN9ia":{"type":"image","settings":{"width":"16%","alignment":"center","image":"shopify:\/\/shop_images\/Sage_Group_logo_svg.png","link":"","block_custom_class":"","animations":"inherit"}},"text_Qtcg6C":{"type":"text","settings":{"width":"100%","alignment":"center","align_text":"left","title":"","text_size":"h2","subheading":"","text":"<p>We process all card payments using Checkout.com which is fully encrypted and 100% secure.<\/p><p>Your card company may also perform additional fraud prevention checks, such as Verified by Visa or Mastercard's 3D secure for added security against fraudulent transactions.<\/p><p>All orders must be paid for before they can be processed for shipment. Once payment is cleared your goods will be processed for delivery and you will be notified that your items are en-route to you.<\/p>","text_color":"body","button_label":"","button_link":"","button_style":"m-button--primary","block_custom_class":"","animations":"inherit"}}},"block_order":["text_4wLaMX","image_xaga4K","image_xBBXye","image_4FL9B8","image_Mf8hkb","image_GgEejK","image_NVN9ia","text_Qtcg6C"],"disabled":true,"settings":{"color_scheme":"","boxed_layout":true,"boxed_color_scheme":"scheme-9b802ae1-d821-4057-8103-ed71b8f01c72","header_divider":false,"header_alignment":"center","header_mobile_alignment":"left","heading":"","heading_size":"h2","subheading":"","description":"","text_color":"body","gap":30,"row_gap":40,"gap_mobile":16,"row_gap_mobile":24,"padding_top":0,"padding_bottom":30,"custom_class":""}},"custom_content_JGptwG":{"type":"custom-content","blocks":{"text_7a3ntc":{"type":"text","settings":{"width":"100%","alignment":"center","align_text":"left","title":"","text_size":"h2","subheading":"","text":"<h3>PRIVACY POLICY<\/h3><p>Ecigone is committed to protecting and respecting your privacy. This summary, together with our full privacy policy and terms of use sets out the basis on which any personal data we collect from you, or that you provide to us, will be processed by us. Please read the following carefully to understand our views and practices regarding your personal data and how we will treat it.<\/p><h4>KLARNA PAYMENT<\/h4><ul><li>In order to be able to offer you Klarna’s payment options, we will pass to Klarna certain aspects of your personal information, such as contact and order details, in order for Klarna to assess whether you qualify for their payment options and to tailor the payment options for you. General information on Klarna you can find <a href=\"https:\/\/www.klarna.com\/uk\" title=\"Here\">here<\/a>. Your personal data is handled in accordance with applicable data protection law and in accordance with the information in <a href=\"https:\/\/cdn.klarna.com\/1.0\/shared\/content\/legal\/terms\/0\/en_gb\/privacy\" title=\"Klarna’s privacy policy\">Klarna’s privacy policy<\/a>.<\/li><\/ul><h4>WE MAY COLLECT AND PROCESS THE FOLLOWING DATA ABOUT YOU:<\/h4><ul><li>We do not store credit card details nor do we share customer details with any 3rd parties for any other activity than solely related to processing an order or sending marketing emails where you have explicitly requested to be received (for marketing emails, this includes first name, surname &<\/li><li> Information that you provide to us in your dealings with us. This includes information provided at the time of registering to use our site, subscribing to our services or requesting further services and\/or information from us.<\/li><li>We may also ask you for information when you enter a competition or promotion sponsored by us, and when you report a problem with our site.<\/li><li>If you contact us, we may keep a record of that correspondence.<\/li><li>Details of transactions you carry out through our site and of the fulfilment of your orders.<\/li><li>Details we receive from credit reference and fraud detection agencies.<\/li><li>Details of your visits to our site including, but not limited to, traffic data, location data and the resources that you access.<\/li><\/ul><h4>IP ADDRESSES<\/h4><p>We may collect information about your computer, including where relevant your IP address, operating system and browser type. This data is processed for the purposes of fraud prevention and administrative purposes.<\/p><h4>COOKIES<\/h4><p>For the same reason, we may obtain information about your general internet usage by using a cookie that is stored on your browser or the hard drive of your computer. Cookies are text files that contain information that is transferred to your computer's hard drive. They help us to improve our site and to deliver a better and more personalised service. Some of the cookies we use are essential for the site to operate, whereas others are aimed at enhancing and personalising your user experience.<\/p><p> <\/p><h4>THE INFORMATION GATHERED BY COOKIES ON OUR SITE(S) MAY BE USED IN THE FOLLOWING WAYS:<\/h4><p>To tailor advertisements or promotions you receive. For example, if you have looked at a specific type of electronic cigarette, we might use this information to personalise any subsequent advertisements you see. We may also personalise our service based on the type of computer system you use, together with the purchase pattern of other customers who may have looked at similar products to you.<\/p><p>We may also provide you with advertisements that may be customised using information such as the search terms you use on our site. For example, if you searched for a specific product or accessed our site via a specific banner ad or search word, we may present you with content and\/or offers linked to that banner ad or search word.<\/p><ul><li>We may use navigational information about where you go on our site to better understand how our site is used and to ensure that the product offerings that are presented to you are relevant.<\/li><li>We do not use any data about where you go or present you with advertisements outside of our site other than on sites that provide for such use in their respective privacy policies.<\/li><li>We may collect information on how frequently you visit the site and the type of products and\/or services that you view to enable us to measure the popularity of our sites and our product offerings.<\/li><\/ul><h4>TYPES OF COOKIES<\/h4><h4>STRICTLY NECESSARY<\/h4><p>These cookies are essential in order to enable you to move around the website and use its features, such as accessing secure areas of the website, remembering how far you are through your pay as you go order, making sure that the ecigone.co.uk website looks consistent or remembering what's in your basket. Without these cookies, many of the basic functionalities of our website - the stuff you expect the site to enable you to do like filling in your shopping basket, we simply can't provide. Tip - these cookies make the basic functions of the website work.<\/p><h5>PERFORMANCE COOKIES<\/h5><p>These cookies collect information about how visitors use our website, for instance, which pages visitors go to most often, and the pages that they don't. This understanding enables Ecig One to continually improve the experience we deliver to you (and other visitors like you) so that the site is easy to use and includes content that you find helpful (for instance, performance cookies indicated that users find reviews really helpful and so that gave us confidence that we should provide more reviews on each smartphone product page) These cookies don't collect information that identifies a visitor - so we can't identify you individually. All the information these cookies collect is aggregated and therefore anonymous. This information is only used to improve how the ecigone.co.uk website works. Tip - these cookies collect anonymous information on the pages visited.<\/p><h4>FUNCTIONALITY COOKIES<\/h4><p>These cookies allow the website to remember the choices you make as you browse the site (for instance, your login details to enable you to provide your comments in our new community forums). They provide more enhanced and personal features. The information they collect is anonymised and the usage only relates to <a href=\"http:\/\/www.ecigone.co.uk\/\" title=\"Www.ecigone.co.uk\">www.ecigone.co.uk<\/a> - they cannot track your browsing activity on other websites once you've departed ecigone.co.uk Tip - these cookies remember choices you have made to improve your website experience on <a href=\"http:\/\/www.ecigone.co.uk\/\" title=\"Www.ecigone.co.uk\">www.ecigone.co.uk<\/a><\/p><h4>ADVERTISING OR TARGETING COOKIES<\/h4><p>These cookies are used to deliver adverts more relevant to you, and your interests (assumed by analysing your onsite browsing behaviour). They can also provide caps on the number of times you might see an advert - to hopefully stop them from becoming annoying and repetitive. These cookies remember that you have visited ecigone.co.uk, track what products you may have looked at, and this information may be shared with our advertising partners. If you see an advert from Ecig One, once you have left our site and are browsing other sites on the internet, that magically seems to understand what previously interested you (you browsed a specific item on the site) then this is enabled by targeting cookies. Tip - these cookies collect information about your browsing habits in order to make advertising more relevant for you.<\/p><p>By using this site, you agree to our use of cookies in the manner outlined above. If you do not wish to receive tailored advertising, you can withdraw this consent at any time by changing your browser settings to reject cookies. Please note that it is not a good idea to reject all cookies as this could prevent you from gaining full use of this site. To learn more about cookies click here, or to disable them click here.<\/p><h4>WHERE WE STORE YOUR PERSONAL DATA<\/h4><p>The data that we collect from you may be transferred to and stored at, a destination outside the European Economic Area (\"EEA\"). It may also be processed by employees operating outside the EEA who work for us or for our suppliers. Such employees may be engaged in, among other things, the processing of your payment details and the provision of support services. Here we will ensure that we have the necessary contracts and other mechanisms in place to make sure your data continues to be treated in accordance with the provisions of the Act. By submitting your personal data, you agree to this transfer, storing or processing.<\/p><p>All information you provide to us is stored on secure servers. Any payment transactions will be encrypted using SSL technology and stored with our payment provider - PayPal. Where we have given you (or where you have chosen) a password that enables you to access certain parts of our site, you are responsible for keeping this password confidential. We ask you not to share a password with anyone.<\/p><h4>YOUR RIGHTS<\/h4><p>If you are a European resident, you have the right to access the personal information we hold about you and to ask that your personal information be corrected, updated, or deleted. If you would like to exercise this right, please contact us via our contact page.<\/p><p>Additionally, if you are a European resident we note that we are processing your information in order to fulfil contracts we might have with you (for example if you make an order through the Site), or otherwise to pursue our legitimate business interests listed above.  Additionally, please note that your information will be transferred outside of Europe, including to Canada and the United States.<\/p><h4>DATA RETENTION<\/h4><p>When you place an order through the Site, we will maintain your Order Information and account details\/preferences for our records unless and until you ask us to delete this information which can be requested via email support@ecigone.co.uk, via phone at 01246 260010 or via post at <a href=\"https:\/\/g.page\/ecigone\" title=\"Unit 1 park road, homewood industrial park, chesterfield, derbyshire, s42 5uy, united kingdom\">Unit 1 Park Road, Homewood Industrial Park, Chesterfield, DERBYSHIRE, S42 5UY, United Kingdom<\/a><strong><br\/><\/strong><\/p><h4>SECURITY<\/h4><p>We have implemented security policies, rules and technical measures to protect the personal data that we have under our control from unauthorised access, improper use and disclosure, unauthorised destruction or accidental loss. <\/p><h4>PAYMENT<\/h4><p>We use Paypal to process all payments, We do not store credit card details.<br\/><br\/>Minors<br\/>The Site is not intended for individuals under the age of 18.<\/p><h4>USES MADE OF THE INFORMATION<\/h4><p>We use information held about you in the following ways:<\/p><ul><li>to provide you with goods and\/or services that you have ordered<\/li><li>to prevent and detect fraud, crime and money laundering<\/li><li>to check your identity<\/li><li>to trace and recover debts<\/li><li>for credit and credit-related services and to manage your accounts<\/li><li>to update our records about you<\/li><li>to make credit, fraud and identity checks on you (when applicable)<\/li><\/ul><p>In addition, Vaping Supplies Online Limited may use your Personal Information for research and statistical analysis to develop and improve our products and services. You will also have the opportunity to consent to us contacting you by post, email, phone, SMS or MMS from time to time occasionally about products and services which Vaping Supplies Online Limited and carefully selected third parties believe may be of interest to you.<\/p><p>By signing up to our newsletter you are authorising us to send regular marketing emails directly from Vaping Supplies Online Limited, your information will never be sold to 3rd parties and you may unsubscribe at any time. We also send confirmation emails if you place an order or if there has been an update to your order which are required as part of the service and are not marketing emails.<\/p><h4>DISCLOSURE OF YOUR INFORMATION<\/h4><p>We may disclose your personal information to any member of  Vaping supplies online UK limited. We may disclose your personal information to third parties:<\/p><ul><li>In the event that we sell or buy any business or assets, in which case we may disclose your personal data to the prospective seller or buyer of such business or assets; and<\/li><li>If we are under a duty to disclose or share your personal data in order to comply with any legal obligation, or in order to enforce or apply our terms of use.<\/li><\/ul><p>We may also provide information about our dealings with you to credit reference and fraud prevention agencies. For full details about the third parties to which your data may be disclosed and how they may process this data, please see our terms of use at <a href=\"https:\/\/ecigone.myshopify.com\/pages\/terms-and-conditions\" title=\"Terms & conditions\">Terms & Conditions<\/a><\/p><h4>CONSENT<\/h4><p>By continuing to use this site and accessing the information on this website, you signal acceptance of the terms and disclaimer set out above. If you do not accept any of these terms, leave this website now.<\/p><h4>ACCESS TO INFORMATION<\/h4><p>The Act gives you the right to access information held about you. Your right of access can be exercised in accordance with the Act. If you wish to have a copy of the data we hold about you, please send an email to our team via email <a href=\"mailto:info@ecigone.co.uk\">info@ecigone.co.uk<\/a>, via phone at <a href=\"tel:01246260010%20\">01246 260010 <\/a>or via post at<br\/><a href=\"https:\/\/g.page\/ecigone\" title=\"Unit 1 park road, homewood industrial park, chesterfield, derbyshire, s42 5uy, united kingdom\">Unit 1 Park Road, Homewood Industrial Park, Chesterfield, DERBYSHIRE, S42 5UY, United Kingdom<\/a><\/p><p> <\/p>","text_color":"body","button_label":"","button_link":"","button_style":"m-button--primary","block_custom_class":"","animations":"inherit"}}},"block_order":["text_7a3ntc"],"settings":{"color_scheme":"","boxed_layout":true,"boxed_color_scheme":"scheme-9b802ae1-d821-4057-8103-ed71b8f01c72","header_divider":false,"header_alignment":"center","header_mobile_alignment":"left","heading":"","heading_size":"h2","subheading":"","description":"","text_color":"body","gap":30,"row_gap":40,"gap_mobile":16,"row_gap_mobile":24,"padding_top":0,"padding_bottom":30,"custom_class":""}}},"order":["f0623cb4-d61c-477b-9340-88388719a38f","main","custom_content_TMAANp","custom_content_JGptwG"]}