{"sections":{"f0623cb4-d61c-477b-9340-88388719a38f":{"type":"breadcrumb","disabled":true,"settings":{"text_alignment":"left","hide_current":false,"hide_on_mb":false,"padding_top":14,"padding_bottom":0,"animations":"inherit"}},"main":{"type":"page","custom_css":[],"settings":{"use_container_narrow":true,"show_breadcrumb":true,"show_page_content":false,"page_header_padding_top":30,"page_header_padding_bottom":30,"padding_top":0,"padding_bottom":30}},"custom_content_P8U3Jc":{"type":"custom-content","blocks":{"text_NYzLXg":{"type":"text","settings":{"width":"100%","alignment":"center","align_text":"left","title":"","text_size":"h2","subheading":"","text":"<p>Ecigone is committed to bringing you the very best that vaping has to offer at unbeatable prices! It’s a big part of what we stand for as the UK’s best online vape store and we want to keep it that way and to do that we want to make sure our prices can never be beaten. <\/p><p>If you do find something cheaper elsewhere we will be happy to price match the product and the process couldn't be simpler, please follow the guide below on how to do this.<\/p><p>So, what qualifies for our <strong>Price Match Guarantee?<\/strong><\/p><p>If you find a product for sale online at a lower price than on our website, it’s a straightforward process, each product on the website will have a; ‘<strong>Found it Cheaper?<\/strong>’ option, if you click that button it will prompt you to input your email address, phone number along with the price you’ve seen it at, and finally a place to paste the website URL of where you found the cheaper price so that we can verify it.<\/p><p>Once we have verified the price difference you will be sent a unique discount code to the email address you have provided which you can then use to match the price of the product in question at the checkout.<\/p><p><strong>Please note<\/strong> - We do not offer a price match from dropshipping websites or direct from China sources. We will only price match on UK based stores.<\/p><h2>Terms & Conditions <\/h2><ul><li>To qualify for the Price Match Guarantee the price must not be part of a promotional deal, or a special email offer from the company in question.<\/li><li>This offer cannot be used in conjunction with any other discounts, promotions or voucher codes<\/li><li>The Price Match Guarantee only applies to the RRP (Recommended Retail Price) and excludes sales, promotions, and any other discount code.<\/li><li>We will not price match for online auction sites such as; eBay or private sellers or e-commerce sites such as; Amazon. <\/li><li>Our Price Match Guarantee is only available for online sales.<\/li><\/ul><p>If you have any questions or concerns do contact us via the <a href=\"https:\/\/ecigone.co.uk\/pages\/contact-us\"><span style=\"text-decoration:underline\">website<\/span><\/a> or give us a call on; 01246 260010 <\/p>","text_color":"body","button_label":"","button_link":"","button_style":"m-button--primary","block_custom_class":"","animations":"inherit"}}},"block_order":["text_NYzLXg"],"settings":{"color_scheme":"","boxed_layout":true,"boxed_color_scheme":"scheme-9b802ae1-d821-4057-8103-ed71b8f01c72","header_divider":false,"header_alignment":"center","header_mobile_alignment":"left","heading":"","heading_size":"h2","subheading":"","description":"","text_color":"body","gap":30,"row_gap":40,"gap_mobile":16,"row_gap_mobile":24,"padding_top":0,"padding_bottom":30,"custom_class":""}}},"order":["f0623cb4-d61c-477b-9340-88388719a38f","main","custom_content_P8U3Jc"]}