{"sections":{"f0623cb4-d61c-477b-9340-88388719a38f":{"type":"breadcrumb","disabled":true,"settings":{"text_alignment":"left","hide_current":false,"hide_on_mb":false,"padding_top":14,"padding_bottom":0,"animations":"inherit"}},"main":{"type":"page","custom_css":[],"settings":{"use_container_narrow":true,"show_breadcrumb":true,"show_page_content":false,"page_header_padding_top":30,"page_header_padding_bottom":30,"padding_top":0,"padding_bottom":30}},"custom_content_pDjGNW":{"type":"custom-content","blocks":{"text_yPHBgi":{"type":"text","settings":{"width":"100%","alignment":"start","align_text":"left","title":"Recycling & Sustainability","text_size":"h2","subheading":"","text":"<p>We all know by now that one of the biggest pollutants is plastic waste, this very often unfortunately ends up in our waterways and has a direct effect on the environment and our precious wildlife population around the world.<\/p><p>Ecigone is committed to becoming a more sustainable and environmentally friendly business, and it is essential that we ensure that materials are recycled properly going forward. It is vitally important that we continue to recycle; glass, metal, wood, paper, cardboard, and plastics as these have a detrimental effect on our environment and wildlife population.<\/p><p>There are some quite staggering statistics surrounding the disposal of disposable vapes in the UK, the below statistics were taken from the ‘Business Waste.co.uk’ website and it’s quite shocking reading which reinforces the need to recycle as much as possible.<\/p><ul><li>Around 138 million disposable vapes are sold in the UK each year.<\/li><li>Every week in the UK 3 million disposable vapes are thrown away, and around 5.4 million every month.<\/li><li>37% of vapers buy single-use vapes and more than 50% of disposable vapes are thrown away.<\/li><li>6 million rechargeable vapes are disposed of in the UK monthly.<\/li><li>23% of people recycle vapes in-store when buying a new one, while about 20% recycle vapes at a local household waste recycling centre.<\/li><li>The number of disposable vapes that end up in landfill each year take up 1.4 million square feet of space – 11 times the size of Trafalgar Square.<\/li><li>The use of disposable vapes in the UK increased by 600% from November 2021 to November 2022.<\/li><li>23 tonnes of lithium go to waste every year when people throw away disposable vapes. It’s enough lithium to power 2,884 electric vehicles.<\/li><li>The production of disposable vapes in the UK releases 59,650 tonnes of CO2 into the atmosphere annually.<\/li><li>Global production of disposable vapes releases about 9 million tonnes of CO2 yearly.<\/li><li>Cigarettes are still worse for the environment than vapes though. Global tobacco uses 600 million trees, 200,000 hectares of land, and 22 billion tonnes of water. It also releases 84 million tonnes of CO2 annually.<\/li><\/ul><p>So, at Ecigone we encourage our customers to recycle your vaping devices, packaging, and any other vaping accessories as much as possible. Below you will find a short guide on the best ways to recycle your vaping devices and e-liquid bottles so let’s all work together to make the future more sustainable for generations to come.<\/p><p>At the bottom of this guide and throughout there will be helpful links in order for you to find the best methods of recycling, and what and where you can recycle your plastics, paper, cardboard, metal, wood, and glass.<\/p><h2>How to recycle your vape kits<\/h2><p>As most vaping devices contain either plastics or metals or sometimes a mixture of both. In this guide we will talk about the ways you can safely and responsibly recycle your vaping equipment.<\/p><p>If it is safe to do so you need to break down your vaping device into its component parts, the first step is to remove any batteries (unless you are using a built-in battery device such as a disposable) then any metal or plastic panels that can easily be removed can be separated and recycled. <\/p><p>For tanks, strip it down into its component parts but make sure you clean the parts with warm soapy water. The glass tank section and any plastics can be recycled with your glass recycling box and the metal and plastic parts can be recycled with your metal\/plastic recycling bags\/boxes.<\/p><p>For batteries, many local supermarkets have designated battery recycling pods\/bins so you can take any batteries and recycle them safely at those locations. You can also visit the ‘Recycle Your Electronics’ website <a href=\"https:\/\/www.recycleyourelectricals.org.uk\/how-to-recycle-electronics\/what-electronics-can-be-recycled\/recycle-vapes\/\"><span style=\"text-decoration:underline\">here<\/span><\/a> and enter your postcode to see where your local recycling centre is.<\/p><p>The paper\/cardboard packaging can also be recycled with your paper\/cardboard recycling at home.<\/p><h2>Disposable Vapes and Pods<\/h2><p>The use of disposable vapes has skyrocketed over the last few years as they are extremely popular with new vapers due to their convenience and lack of maintenance involved. Unfortunately, they are very wasteful and sadly many people either don’t know how to dispose of them properly or just throw them on the ground when they have finished with them. <\/p><p>I think we can all agree that’s not a good way to deal with your disposable vape and it’s one of the reasons why disposables are hotly debated at Government level at the moment due to their environmental impact. But, there are ways to recycle disposable vapes, firstly if you are confident you can disassemble the disposable into its component parts and recycle the plastic and metal parts in the usual manor, alternatively you can find where you nearest e-waste\/vape recycling centre by visiting the ‘Recycle Your Electronics’ <a href=\"https:\/\/www.recycleyourelectricals.org.uk\/how-to-recycle-electronics\/what-electronics-can-be-recycled\/recycle-vapes\/\"><span style=\"text-decoration:underline\">website<\/span><\/a> and entering your postcode.<\/p><h2>How to recycle e-liquid bottles<\/h2><p>As e-liquid bottles, caps, and pouring nibs are made of plastic these can be recycled with your plastic waste. Also, any cardboard packaging that your e-liquid may have come in can be recycled with your normal paper\/cardboard recycling.<\/p><p>We all understand the need to keep as much plastic waste away from our water courses and oceans to protect our environment and our precious wildlife population worldwide so responsibly recycling your e-liquid bottles will massively help in reducing plastic waste.<\/p><h2>How do I recycle vape batteries?<\/h2><p>Fortunately there’s nothing inherently different from vape batteries to normal batteries so they can absolutely be recycled wherever you would normally recycle your used batteries. Many of the big chain supermarkets have battery recycling pods\/bins, along with some local corner shops and at many Post Office locations. Again, you can also visit the ‘Recycle Your Electronics’ website <a href=\"https:\/\/www.recycleyourelectricals.org.uk\/how-to-recycle-electronics\/what-electronics-can-be-recycled\/recycle-vapes\/\"><span style=\"text-decoration:underline\">here<\/span><\/a> and enter your postcode to see where your local recycling centre is. Lastly, you can also contact your local authority (Council) and they will be able to tell you what and where you can recycle your vape batteries.<\/p><h2>Let talk about your carbon footprint<\/h2><p>Along with recycling one of the biggest impacts on our environment is your carbon footprint, that’s why we will always strongly encourage fellow and new vapers to purchase your vaping hardware, e-liquids, and accessories from UK based vape stores such as Ecigone to help reduce the carbon footprint of your products.<\/p><h2>Contact Us<\/h2><p>If you have any questions or queries then you can send us a message via the <a href=\"https:\/\/ecigone.co.uk\/pages\/contact-us\"><span style=\"text-decoration:underline\">website<\/span><\/a>, send us an email at; info@ecigone.co.uk or call us on; 01246 260010 Mon-Fri 9am - 4pm.<\/p><p><strong>Links to useful resources;<\/strong><\/p><ul><li><strong>Recycle Your Electronics<\/strong> - <a href=\"https:\/\/www.recycleyourelectricals.org.uk\/how-to-recycle-electronics\/what-electronics-can-be-recycled\/recycle-vapes\/\"><span style=\"text-decoration:underline\">https:\/\/www.recycleyourelectricals.org.uk\/how-to-recycle-electronics\/what-electronics-can-be-recycled\/recycle-vapes\/<\/span><\/a><\/li><li><strong>Eco Recycle<\/strong> - <a href=\"https:\/\/eco-recycle.co.uk\/disposable-vape-recycling-in-the-uk\/\"><span style=\"text-decoration:underline\">https:\/\/eco-recycle.co.uk\/disposable-vape-recycling-in-the-uk\/<\/span><\/a><\/li><li><strong>Find your local authority<\/strong> - <a href=\"https:\/\/www.gov.uk\/find-local-council\"><span style=\"text-decoration:underline\">https:\/\/www.gov.uk\/find-local-council<\/span><\/a><\/li><\/ul>","text_color":"body","button_label":"","button_link":"","button_style":"m-button--primary","block_custom_class":"","animations":"inherit"}}},"block_order":["text_yPHBgi"],"settings":{"color_scheme":"","boxed_layout":true,"boxed_color_scheme":"scheme-9b802ae1-d821-4057-8103-ed71b8f01c72","header_divider":false,"header_alignment":"center","header_mobile_alignment":"left","heading":"","heading_size":"h2","subheading":"","description":"","text_color":"body","gap":30,"row_gap":40,"gap_mobile":16,"row_gap_mobile":24,"padding_top":0,"padding_bottom":30,"custom_class":""}}},"order":["f0623cb4-d61c-477b-9340-88388719a38f","main","custom_content_pDjGNW"]}