{"sections":{"6205d07a-2aa1-4964-8333-a8d7829c44bc":{"type":"breadcrumb","disabled":true,"settings":{"text_alignment":"left","hide_current":false,"hide_on_mb":false,"padding_top":10,"padding_bottom":0,"animations":"inherit"}},"page":{"type":"page","settings":{"use_container_narrow":true,"show_breadcrumb":true,"show_page_content":false,"page_header_padding_top":30,"page_header_padding_bottom":0,"padding_top":0,"padding_bottom":30}},"main":{"type":"page-faqs","blocks":{"c1c6b647-dc12-471a-9c64-52fe3d961d87":{"type":"image","settings":{"image":"shopify:\/\/shop_images\/Frequently_Asked_Questions_Blue_and_Pink_Modern_Facebook_Cover_1640_x_500_px.png"}},"text_na4b7T":{"type":"text","settings":{"text":"<p><strong>Account Queries <\/strong><\/p>","text_size":"h3","text_color":"body","font_family":"body"}},"accordion-1":{"type":"accordion","settings":{"title":"Do I need to create an account with Ecigone to place an order?","content":"<p>While creating an account with Ecigone will help you to keep track of your orders, to allow you to collect loyalty points with every order and to receive promotional offers, it isn’t a requirement to place an order. We have a guest checkout option should you wish to not create an account where the only details you will need to provide are your shipping and payment details. <\/p>","open":true}},"accordion-2":{"type":"accordion","settings":{"title":"How do I access my online account?","content":"<p>When you visit the Ecione website, along the top-right edge of the page you will see an icon of a person (highlighted in red below), if you click on it, you will be taken to the account sign in page. You can also sign in to your account from the checkout page.<\/p>","open":false}},"accordion-3":{"type":"accordion","settings":{"title":"What do I do if I’ve forgotten my password?","content":"<p>If you have forgotten your password you can reset them via the Account Sign In page by clicking the person icon (illustrated above) and clicking on the; ‘Forgotten Password’ link, click the link and follow the steps to reset your password. You will receive a link via email that will allow you to set a new password for your account.<\/p>","open":false}},"text_X3j3p3":{"type":"text","settings":{"text":"<p><strong>Order Queries<\/strong><\/p>","text_size":"h3","text_color":"body","font_family":"body"}},"accordion_K7keNA":{"type":"accordion","settings":{"title":"Where is my order?","content":"<p>If you have successfully placed an order with us you will see an ‘Order Confirmed’ page with the details of what you have ordered and your order number. You will also receive an order confirmation email and you will also see your order in your account page on our website (unless you used the guest checkout option)<\/p><p>If you believe you have placed an order on our website but it either isn’t showing on your account page or you haven’t received an order confirmed email please contact us and a member of our team will only be too happy to assist you further.<\/p>","open":false}},"accordion_WFDHbG":{"type":"accordion","settings":{"title":"How do I access my order information?","content":"<p>All of the orders you have placed with us will be stored in your online account. You should also receive an order confirmation email that confirms what you have ordered and that the order has been successfully received by us. Your account section will also show all of your previous orders with us.<\/p>","open":false}},"accordion_zE6mzC":{"type":"accordion","settings":{"title":"My order hasn’t arrived yet?","content":"<p>Depending on which shipping option you choose, some delays that are beyond our control can unfortunately happen but under normal circumstances it can take up to 14 days to receive your order. If you haven’t received your order within 2-3 days please check that your shipping details are correct on either your online account or on the order confirmation email.<\/p><p><\/p><p>If 14 days have passed and you still haven’t received your order, please contact us and we will track the package for you and resolve any issues as soon as possible.<\/p>","open":false}},"accordion_y7NQYY":{"type":"accordion","settings":{"title":"Does my order come with a warranty?","content":"<p>Please refer to our warranties page for details on the warranty information of all our products.<\/p>","open":false}},"accordion_4WcyFX":{"type":"accordion","settings":{"title":"The item I’m looking for is out of stock, when will it come back in?","content":"<p>At Ecigone we do our best to make sure as many products as possible are kept in stock but, due to the popularity of some products you may find something you’re looking for is out of stock at the moment. When you do come across an out of stock product, there will be a ‘Notify me when available’ button on the website, click this button and add your email address and we will email you when the product is back in stock.<\/p>","open":false}},"accordion_t98CJP":{"type":"accordion","settings":{"title":"How do I cancel my order?","content":"<p>We understand that sometimes you may want to cancel an order you have placed with us, we just need to know as soon as possible. As we ship orders the same day Monday - Friday we will need to know if you wish to cancel the order before 4pm. If you contact us after 4pm it is likely your order will have already been dispatched and in which case you will have to go through the returns process when the order arrives as long as they are in an unopened and re-sellable condition. Please refer to our ‘Returns’ policy for more information.<\/p>","open":false}},"accordion_EndnRE":{"type":"accordion","settings":{"title":"I want to change my delivery address?","content":"<p>If you have just placed an order with us and you wish to change the delivery address details please contact us as soon as possible so we can assist you. If however, you contact us after 4pm there’s a high chance that your order will have already been shipped. If your order has already been dispatched, we are unable to take any action until the package has been returned to us. Once we have received the order back to us we can then arrange to have the order shipped to a new address.<\/p>","open":false}},"accordion_QzgeXz":{"type":"accordion","settings":{"title":"How do I view previous orders?","content":"<p>Providing you have created an account with us, all of your current and past orders will be stored in your account. Simply, login where all of your current and past orders will be shown.<\/p>","open":false}},"accordion_gwzTKM":{"type":"accordion","settings":{"title":"How do I order the same items again?","content":"<p>If you login to your account and view your orders, click on the one you want to order again and you will see a; ‘Buy Again’ button where you can place an order for the same items.<\/p>","open":false}},"accordion_DM4jXQ":{"type":"accordion","settings":{"title":"How do I apply a discount code?","content":"<p>Discount codes can be applied at the checkout page before placing an order. When at the checkout page, you will see on the right hand side below the item you want to purchase there will be a discount or gift card box (illustrated below) simply enter your code and click the ‘Apply’ button to redeem your code.<\/p>","open":false}},"accordion_AezTNQ":{"type":"accordion","settings":{"title":"Can I stack multiple discount codes together?","content":"<p>Unfortunately not, it’s not possible to stack multiple discount codes together. Reward points are converted into discount codes when redeemed and therefore cannot be used together with any other discount code(s).<\/p>","open":false}},"accordion_GL6thH":{"type":"accordion","settings":{"title":"How Do I redeem the 10% off discount code for signing up to the offers\/newsletter?","content":"<p>If you are new to Ecigone you can claim a 10% off your first order discount code. To claim this offer you have to enter your email address at the bottom of the website (as illustrated below) Once you have signed up you will receive an email with your discount code to use on your first order with us.<\/p>","open":false}},"text_JaV7yU":{"type":"text","settings":{"text":"<p><strong>Shipping Queries<\/strong><\/p>","text_size":"h3","text_color":"body","font_family":"body"}},"accordion_eKBRQE":{"type":"accordion","settings":{"title":"Does Ecigone ship to my country?","content":"<p>We do offer worldwide shipping. For UK customers we offer Royal Mail and DPD delivery options. For our international customers we offer UPS International. If however you do not see a shipping option at checkout, please contact us for a quote. <strong>Please Note: <\/strong>You will be liable for any import duties and fees upon delivery. Please refer to our ‘Shipping and Returns’ policies for more information.<\/p>","open":false}},"accordion_7kDahC":{"type":"accordion","settings":{"title":"Do I get a tracking number with my order?","content":"<p>If you are based in the UK and you have selected a tracked delivery service at checkout you will get shipping updates via email. If you require the tracking number for an order please contact us where we will be able to assist you with tracking your order.<\/p>","open":false}},"accordion_bB84BU":{"type":"accordion","settings":{"title":"How long will it take for my order to arrive?","content":"<p>This depends on which shipping option you chose at checkout. Below is a list of estimated delivery times;<\/p><ul><li>For RM24 Tracked we estimate a 1-2 day delivery time<\/li><li>For RM48 Tracked we estimate a 2-5 day delivery time<\/li><li>For DPD we estimate a next working day delivery time or a Saturday delivery for DPD Saturday.<\/li><li>For International order this depends on the country and customs clearance.<\/li><\/ul>","open":false}},"accordion_4xAENK":{"type":"accordion","settings":{"title":"How will my order arrive?","content":"<p>All orders will be placed into jiffy bag envelopes for protection and products such as; mods, tanks, and kits will all come in crush proof boxes to ensure your order arrives safe and sound. If you do receive an order that has been damaged in transit please contact us as soon as possible to rectify the issue.<\/p>","open":false}},"accordion_3myyKG":{"type":"accordion","settings":{"title":"How quickly will my order be dispatched?","content":"<p>All orders placed before 4pm, Monday - Friday will be dispatched the same day. Orders placed after 4pm, on the weekend, or during a Bank Holiday will be dispatched the next working day.<\/p>","open":false}},"accordion_4NPfkf":{"type":"accordion","settings":{"title":"Has my order been dispatched yet?","content":"<p>You will receive a shipping confirmation email when your order has been dispatched. If you haven’t received a shipping confirmation email then your order hasn’t been shipped yet. If you have any questions or queries regarding your order then please contact us where we will be happy to assist you.<\/p>","open":false}},"accordion_KJxPBW":{"type":"accordion","settings":{"title":"How much does shipping cost?","content":"<p>UK shipping is free for orders over £30 for RM48 Tracked, and free when you spend over £60 for RM24 Tracked and DPD delivery options. For more detailed information on shipping costs please visit our ‘Shipping and Returns’ policy here. If you are outside of the UK shipping rates depend on the size, weight and shipping destination.<\/p>","open":false}},"accordion_iVJrYw":{"type":"accordion","settings":{"title":"Do you offer next day shipping?","content":"<p>Yes we do! Provided you’re in mainland UK, we offer DPD next day delivery service which costs £4.49 for orders under £30, £3.99 for orders over £30, and FREE when you spend over £60!<\/p>","open":false}},"text_3hzATW":{"type":"text","settings":{"text":"<p><strong>Payment and Billing Queries<\/strong><\/p>","text_size":"h3","text_color":"body","font_family":"body"}},"accordion_LbqGib":{"type":"accordion","settings":{"title":"What cards do you accept?","content":"<p>We accept all major debit and credit cards including Visa, Mastercard, and American Express.<\/p>","open":false}},"accordion_YpfHt6":{"type":"accordion","settings":{"title":"Do you accept Klarna?","content":"<p>Yes, we offer buy now, pay later services through Klarna. Please select Klarna as your payment method at checkout and you will be redirected to Klarna for approval.<\/p>","open":false}},"accordion_wrMJiX":{"type":"accordion","settings":{"title":"Why does my card keep declining?","content":"<p>There may be a number of reasons why your card may be declining. The most common reason is that the billing\/card information has been incorrectly entered.<\/p><ul><li>Make sure the billing information is correct for the card you are trying to use. You need to enter the address that your card is registered to. You can select a different shipping address however if the billing address does not match the order is likely to be rejected.<\/li><li>Please ensure the card details have been entered correctly and that all details including the CV2 (the 3 digits on the back of your card or 4 digits on the front if using Amex) are correct.<\/li><li>Finally check that you are using a card type we accept. We accept payments from Visa, Visa Debit, Mastercard and American Express.<\/li><li>If you are ordering from outside the UK please check with your bank that you can make international purchases with that card.<\/li><li>If you are still having issues making payment, please contact us and we will try and help resolve the problem.<\/li><\/ul>","open":false}},"text_hT7RcE":{"type":"text","settings":{"text":"<p><strong>Problems with my Order<\/strong><\/p>","text_size":"h3","text_color":"body","font_family":"body"}},"accordion_bWTi34":{"type":"accordion","settings":{"title":"My order arrived incomplete\/Items missing?","content":"<p>If your order has arrived incomplete or has missing items please contact us as soon as possible quoting your order number and a description of the problem and a member of our team will get back to you as soon as possible to rectify the issue.<\/p>","open":false}},"accordion_C9FxN6":{"type":"accordion","settings":{"title":"There’s a problem with the products I have ordered?","content":"<p>Should you experience issues with an item you have purchased from Ecigone please get in touch as soon as possible where we will either help resolve the issue over the phone (where possible) or arrange to have the item sent back to us to test and verify the issue you are facing with the aim of replacing or refunding the item, whichever is the most suitable. For details on warranty claims, please see our warranty page for more information.<\/p>","open":false}},"accordion_y8BwRD":{"type":"accordion","settings":{"title":"Items have arrived damaged or broken, what do I do?","content":"<p>Once an item has been shipped from us we have no control over what happens to it and unfortunately some things do get damaged in transit. If this happens please contact us within 14 days of delivery and we will only be too happy to assist you.<\/p>","open":false}},"text_FrKyhf":{"type":"text","settings":{"text":"<p><strong>Ecigone Reward Points<\/strong><\/p>","text_size":"h3","text_color":"body","font_family":"body"}},"accordion_pJBKMT":{"type":"accordion","settings":{"title":"How do I sign up for Ecigone rewards?","content":"<p>All you need to do to qualify for Ecigone rewards is to create an online account. Once you have logged into your account, click the ‘Rewards’ button on the left hand side of the website to show your points balance and to learn how to gain and redeem points.<\/p>","open":false}},"accordion_4xyyaR":{"type":"accordion","settings":{"title":"How do I check my reward points balance?","content":"<p>Simply log in to your account and click the ‘Rewards’ button on the left hand side of the page to reveal your points balance.<\/p>","open":false}},"accordion_VLW3DV":{"type":"accordion","settings":{"title":"How do I check what VIP tier I’m at?","content":"<p>Log in to your account and click the ‘Rewards’ button on the left hand side of the page to see your VIP level.<\/p>","open":false}},"accordion_JAtcXH":{"type":"accordion","settings":{"title":"Do my Ecigone reward points expire?","content":"<p>Your Ecigone rewards points expire 12 months from the date they were awarded to you so make sure you redeem them within 12 months.<\/p>","open":false}},"accordion_jQaTi6":{"type":"accordion","settings":{"title":"Can I redeem my Ecigone reward points for cash?","content":"<p>Ecigone reward points are non transferable and they have no cash value. They cannot be redeemed for cash and they can only be used against future purchases on our website. If you have any questions or queries regarding the Ecigone rewards scheme, please contact us.<\/p>","open":false}}},"block_order":["c1c6b647-dc12-471a-9c64-52fe3d961d87","text_na4b7T","accordion-1","accordion-2","accordion-3","text_X3j3p3","accordion_K7keNA","accordion_WFDHbG","accordion_zE6mzC","accordion_y7NQYY","accordion_4WcyFX","accordion_t98CJP","accordion_EndnRE","accordion_QzgeXz","accordion_gwzTKM","accordion_DM4jXQ","accordion_AezTNQ","accordion_GL6thH","text_JaV7yU","accordion_eKBRQE","accordion_7kDahC","accordion_bB84BU","accordion_4xAENK","accordion_3myyKG","accordion_4NPfkf","accordion_KJxPBW","accordion_iVJrYw","text_3hzATW","accordion_LbqGib","accordion_YpfHt6","accordion_wrMJiX","text_hT7RcE","accordion_bWTi34","accordion_C9FxN6","accordion_y8BwRD","text_FrKyhf","accordion_pJBKMT","accordion_4xyyaR","accordion_VLW3DV","accordion_JAtcXH","accordion_jQaTi6"],"settings":{"enable_narrow_width":true,"padding_top":30,"padding_bottom":30}}},"order":["6205d07a-2aa1-4964-8333-a8d7829c44bc","page","main"]}