{"sections":{"f0623cb4-d61c-477b-9340-88388719a38f":{"type":"breadcrumb","disabled":true,"settings":{"text_alignment":"left","hide_current":false,"hide_on_mb":false,"padding_top":14,"padding_bottom":0,"animations":"inherit"}},"main":{"type":"page","custom_css":[],"settings":{"use_container_narrow":true,"show_breadcrumb":true,"show_page_content":false,"page_header_padding_top":30,"page_header_padding_bottom":30,"padding_top":0,"padding_bottom":30}},"custom_content_mCLYFt":{"type":"custom-content","blocks":{"text_J36JYa":{"type":"text","settings":{"width":"100%","alignment":"start","align_text":"left","title":"","text_size":"h2","subheading":"","text":"<h2>Warranty Information<\/h2><p>As most vape kits consist of varying parts, mod, tank, pod, and batteries (if not built-in) they will be subject to different warranty periods and stipulations due to the consumable nature of some elements, such as coils, pods, and batteries. If your order has been damaged due to shipping issues or for missing items, please contact Ecigone within 48hrs from the delivery date, and we will assist you.<\/p><h3>Vape Kits & Mods<\/h3><p>Vape kits and mods are covered by a 30 day refund period and a 90 day warranty for replacements. You will also get up to 6 months of extended manufacturer's warranty. For extended warranty claims Ecigone will help customers liaise with manufacturers and will assist and provide support in claims where necessary.<\/p><p>Accidental damage or normal wear and tear are not covered by either Ecigone’s warranty or via the manufacturer's extended warranty. If your vape kit or mod has been damaged, your warranty will be null and void. For warranty claims please contact Ecigone in the first instance and retain all of the retail packaging for your device. <\/p><p>For eligible warranty claims you will be required to send the item back to Ecigone for assessment and to enable us to duplicate and verify the issue(s) that have been reported to us. We do ask that you allow us at a minimum of 48hrs to test a product, we may sometimes require more time especially if the fault is intermittent but we will also keep you informed during the process.<\/p><p>Once a return has been verified we will supply you with a pre-paid postage label to either download and print at home or print in store (collect+) <\/p><h3>Batteries<\/h3><p>For batteries Ecigone offers a 60 day warranty period on all external batteries from the date of receipt. However, this warranty period will be void if the battery(ies) are damaged due to misuse or mis-handling. Also, general wear and tear is also not covered in the 60 day warranty period. <\/p><p>If you think your battery(ies) are faulty then please contact us stating the nature of the fault and we will assess the problem on a case-by-case basis. If however you believe the issue is a manufacturing fault we will replace the battery for you. You may be required to return your battery(ies) to enable us to verify any fault that may be present.<\/p><p>Once a return has been verified we will supply you with a pre-paid postage label to either download and print at home or print in store (collect+) <\/p><h3>Battery Chargers<\/h3><p>All of the battery chargers that Ecigone sells are covered by a 12 month warranty from the date of purchase. If however, the charger is deemed to be faulty due to user error or mishandling the warranty will be null and void.<\/p><p>In the first instance please contact Ecigone and give us a detailed account of the issue(s) you are facing to enable us to understand the specific complaint and it will help us in diagnosing any issues should we require you to return the charger to us for testing purposes.<\/p><p>Once a return has been verified we will supply you with a pre-paid postage label to either download and print at home or print in store (collect+) <\/p><h3>E-liquids, Pods, and Disposables<\/h3><p>E-liquids, pods, and disposable vape kits are sold in sealed packaging and as a result are not covered by a warranty period. The only exception to this rule is when there is a manufacturing defect or fault with the product.<\/p><p>If you believe a product you have received is faulty upon arrival, please contact Ecigone within 7 days from the date the product was delivered so that we can assist you. If your product has arrived damaged due to shipping issues, we will replace the items once you have contacted us and sent evidence of the damage.<\/p><p>If you find there are missing items when your order arrives please contact Ecigone within 48hrs of delivery to enable us to rectify the issue.<\/p><p>Once a return has been verified we will supply you with a pre-paid postage label to either download and print at home or print in store (collect+) <\/p><p><strong>Please Note: <\/strong>For warranty claims on disposables, we will require the batch number from the original packaging. Unfortunately, we are unable to process warranty claims without this information. Depending on the issue we may require further photographic or video evidence of the issue. Additionally, we cannot offer a replacement or refund on devices that have either been thrown away or discarded.<\/p><h3>Tanks, Clearomisers, and Cartomisers<\/h3><p>Due to the consumable nature of tanks, clearomiser, and cartomisers they are not covered under warranty. However, if the product is deemed to be faulty or DOA (dead on arrival) and we have been notified within 7 days we will replace or offer to refund the product at our discretion.<\/p><p>You will be required to return the product to us for inspection and testing by our returns team. We will not offer replacements and refunds if we determine the product was damaged by the user.<\/p><p>Once a return has been verified we will supply you with a pre-paid postage label to either download and print at home or print in store (collect+) <\/p><h2>How to Make A Claim<\/h2><p>If you believe you have purchased a faulty product from us and wish to make a warranty claim, please contact our team at Ecigone via our email address; <a href=\"mailto:info@ecigone.co.uk\"><span style=\"text-decoration:underline\">info@ecigone.co.uk<\/span><\/a>, via our live chat, or give us a call on; 01246 260010 where we will be only too happy to assist you.<\/p><p>For warranty claims you will be asked to provide as much detailed information regarding the fault as possible, and to provide your order number or proof of purchase along with the serial number and batch number of the product in order for us to correctly identify the order and trace the fault with the manufacturer where necessary.<\/p><p>Ecigone will require the faulty product to be returned to us for investigation and testing purposes. Once we have verified the issue, and we have deemed the product to be faulty we will then offer either a refund or replacement. If however, we find the product to not be faulty, the product will be sent back to you at your own cost.<\/p>","text_color":"body","button_label":"","button_link":"","button_style":"m-button--primary","block_custom_class":"","animations":"inherit"}}},"block_order":["text_J36JYa"],"settings":{"color_scheme":"","boxed_layout":true,"boxed_color_scheme":"scheme-9b802ae1-d821-4057-8103-ed71b8f01c72","header_divider":false,"header_alignment":"center","header_mobile_alignment":"left","heading":"","heading_size":"h2","subheading":"","description":"","text_color":"body","gap":30,"row_gap":40,"gap_mobile":16,"row_gap_mobile":24,"padding_top":0,"padding_bottom":30,"custom_class":""}}},"order":["f0623cb4-d61c-477b-9340-88388719a38f","main","custom_content_mCLYFt"]}