{"sections":{"f0623cb4-d61c-477b-9340-88388719a38f":{"type":"breadcrumb","disabled":true,"settings":{"text_alignment":"left","hide_current":false,"hide_on_mb":false,"padding_top":14,"padding_bottom":0,"animations":"inherit"}},"main":{"type":"page","custom_css":[],"settings":{"use_container_narrow":true,"show_breadcrumb":true,"show_page_content":false,"page_header_padding_top":30,"page_header_padding_bottom":30,"padding_top":0,"padding_bottom":30}},"custom_content_YMaxT9":{"type":"custom-content","blocks":{"text_xRM3Pr":{"type":"text","settings":{"width":"100%","alignment":"start","align_text":"left","title":"","text_size":"h2","subheading":"","text":"<p>All of the procuts on the Ecigone website are fully TPD\/TRPR compliant. If you want to learn more about how TPD\/TRPR compliance affects vaping then please read the explanation below.<\/p><h2>TPD Explained<\/h2><p>TPD, which stands for; ‘Tobacco Products Directive’ is a set of regulations that were created for the European Union to govern the manufacturing, presentation, and sale of tobacco and related products. The current iteration, known as TPD2, was adopted in 2014 and came into effect in 2016, replacing the original directive from 2001. Visit the <a href=\"https:\/\/health.ec.europa.eu\/tobacco\/product-regulation\/implementing-tobacco-products-directive-directive-201440eu\/revision-tobacco-products-directive_en\"><span style=\"text-decoration:underline\">EU Public Health<\/span><\/a> website for more in-depth explanations. While TPD covers tobacco products it also covers vaping, below is a basic list of what’s affected by the TPD regulations:<\/p><ul><li>2ml Maximum tank capacity<\/li><li>20mg maximum nicotine strength in 10ml bottles<\/li><li>Warning labels and ingredients list<\/li><\/ul><h2>TRPR Explained<\/h2><p>TRPR, which stands for; ‘Tobacco and Related Products Regulations’ is very similar in scope to the TPD regulations but TRPR is more relevant to the UK market. <\/p><p><strong>The TRPR introduced rules which ensure:<\/strong><\/p><ul><li>Minimum standards for the safety and quality of all e-cigarettes and refill containers (otherwise known as e-liquids)<\/li><li>That information is provided to consumers so that they can make informed choices<\/li><li>An environment that protects children from starting to use these products.<\/li><\/ul><p><strong>The requirements:<\/strong><\/p><ul><li>Restrict e-cigarette tanks to a capacity of no more than 2ml<\/li><li>Restrict the maximum volume of nicotine-containing e-liquid for sale in one refill container to 10ml<\/li><li>Restrict e-liquids to a nicotine strength of no more than 20mg\/ml<\/li><li>Require nicotine-containing products or their packaging to be child-resistant and tamper evident<\/li><li>Ban certain ingredients including colourings, caffeine and taurine<\/li><li>Include new labelling requirements and warnings<\/li><li>Require all e-cigarettes and e-liquids be notified and published by the MHRA before they can be sold<\/li><\/ul><h2>Why do the TPD & TRPR regulations affect vaping?<\/h2><p>It’s easy to see why regulations came into force as before we had these regulations, the vaping market was kind of like the Wild West with no clear way to know what ingredients are in your e-liquid and no control over the nicotine content of e-liquids. Not only that but consumers had no way of knowing if a particular e-liquid had been manufactured in the correct environments or had passed any proper testing so it was clear something had to be done to protect public health.<\/p><p>While a lot of people consider any Government interference as bad or overbearing but for the sake of the vaping industry it was a must to protect business and most importantly the consumer like me and you. <\/p><h2>So, when did all this come into effect?<\/h2><p>The TPD regulations were first introduced in 2014 and both TPD and TRPR regulations became law on the 20th of May 2016 in the EU and the UK. This meant that all non-compliant stock that businesses still had to be sold or destroyed\/removed from sale by that date. <\/p><p>As a result of the TPD & TRPR regulations you may have noticed certain brands are no longer available and this is due to the brand either backing out of the vaping market or they have failed to comply with the new regulations and thus are no longer allowed to sell their products in the EU and the UK.<\/p><h2>What have Ecigone done to comply with the TPD & TRPR regulations?<\/h2><p>When the TPD & TRPR regulations came into force, Ecigone fully complied with the guidelines set out in the regulations and Ecigone is now a fully TPD & TRPR compliant business. All of our e-liquids, tanks, and pods conform to the regulations by offering a maximum 20mg nicotine concentration, and a maximum 2ml e-liquid capacity for our tanks and pods.<\/p><p>All of the e-liquids that are on sale on the Ecigone website have been submitted and passed the MHRA certification, with all of them being declared as TPD compliant.<\/p><p>Also, none of the products for sale on the Ecigone website contains caffeine, taurine, are diacetyl free and are also free of any other additive aside from standard PG, VG ratios and flavourings. All of the ingredients found in the e-liquids we sell are listed on the packaging and all of them come with relevant nicotine and health warnings to comply with the TPD & TRPR regulations.<\/p><p>For new vapers (within the last few years) it’s unlikely you will have noticed any changes but if you do have any questions or queries regarding the TPD & TRPR regulations then you can contact us via our <a href=\"https:\/\/ecigone.co.uk\/pages\/contact-us\"><span style=\"text-decoration:underline\">website<\/span><\/a>, email us at; <a href=\"mailto:info@ecigone.co.uk\"><span style=\"text-decoration:underline\">info@ecigone.co.uk<\/span><\/a>, talk to us via our online chat service, and call us on; 01246 260010 Mon-Fri, 9am-4pm.<\/p>","text_color":"body","button_label":"","button_link":"","button_style":"m-button--primary","block_custom_class":"","animations":"inherit"}}},"block_order":["text_xRM3Pr"],"settings":{"color_scheme":"","boxed_layout":true,"boxed_color_scheme":"scheme-9b802ae1-d821-4057-8103-ed71b8f01c72","header_divider":false,"header_alignment":"center","header_mobile_alignment":"left","heading":"","heading_size":"h2","subheading":"","description":"","text_color":"body","gap":30,"row_gap":40,"gap_mobile":16,"row_gap_mobile":24,"padding_top":0,"padding_bottom":30,"custom_class":""}}},"order":["f0623cb4-d61c-477b-9340-88388719a38f","main","custom_content_YMaxT9"]}